Revit 2024 API
CableTrayType.IsWithFitting Property
 Whether this cable tray type is with fitting
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsWithFitting { get; }
Visual Basic
Public ReadOnly Property IsWithFitting As Boolean
	Get
Visual C++
public:
property bool IsWithFitting {
	bool get ();
}
Remarks
 True if this cable tray type is with fitting type.
See Also
CableTrayType Class
Autodesk.Revit.DB.Electrical Namespace